benchmark/leveldb/results/new-micro/mris_ran_wt_hybrid.3.log
LevelDB:    version 1.5
Date:       Sun Dec  2 02:57:23 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
./table/mris.h:637: [mris] Failed to open /mnt/largespace/mris_ran_wt_db
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
----- /mnt/largespace/mris_ran_wt_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0
mris_ran_wt  :   10552.130 micros/op;    6.3 MB/s
Microseconds per op:
Count: 20000  Average: 10551.9129  StdDev: 253933.65
Min: 120.0000  Median: 732.8612  Max: 11526472.0000
------------------------------------------------------
[     120,     140 )    8379  41.895%  41.895% ########
[     140,     160 )     996   4.980%  46.875% #
[     160,     180 )      91   0.455%  47.330% 
[     180,     200 )     207   1.035%  48.365% 
[     200,     250 )      81   0.405%  48.770% 
[     250,     300 )       3   0.015%  48.785% 
[     300,     350 )       3   0.015%  48.800% 
[     350,     400 )       1   0.005%  48.805% 
[     600,     700 )     123   0.615%  49.420% 
[     700,     800 )     353   1.765%  51.185% 
[     800,     900 )    1725   8.625%  59.810% ##
[     900,    1000 )    1368   6.840%  66.650% #
[    1000,    1200 )     534   2.670%  69.320% #
[    1200,    1400 )     571   2.855%  72.175% #
[    1400,    1600 )     256   1.280%  73.455% 
[    1600,    1800 )      31   0.155%  73.610% 
[    1800,    2000 )    1131   5.655%  79.265% #
[    2000,    2500 )    1875   9.375%  88.640% ##
[    2500,    3000 )     141   0.705%  89.345% 
[    3000,    3500 )      34   0.170%  89.515% 
[    3500,    4000 )      44   0.220%  89.735% 
[    4000,    4500 )     309   1.545%  91.280% 
[    4500,    5000 )     825   4.125%  95.405% #
[    5000,    6000 )     554   2.770%  98.175% #
[    6000,    7000 )      21   0.105%  98.280% 
[    7000,    8000 )      18   0.090%  98.370% 
[    8000,    9000 )       4   0.020%  98.390% 
[   50000,   60000 )      98   0.490%  98.880% 
[   60000,   70000 )     183   0.915%  99.795% 
[   80000,   90000 )       5   0.025%  99.820% 
[   90000,  100000 )       7   0.035%  99.855% 
[  100000,  120000 )       1   0.005%  99.860% 
[  180000,  200000 )       1   0.005%  99.865% 
[  200000,  250000 )       1   0.005%  99.870% 
[  900000, 1000000 )       1   0.005%  99.875% 
[ 2000000, 2500000 )       1   0.005%  99.880% 
[ 3000000, 3500000 )       1   0.005%  99.885% 
[ 4000000, 4500000 )       2   0.010%  99.895% 
[ 4500000, 5000000 )       1   0.005%  99.900% 
[ 5000000, 6000000 )       6   0.030%  99.930% 
[ 6000000, 7000000 )       3   0.015%  99.945% 
[ 7000000, 8000000 )       5   0.025%  99.970% 
[ 8000000, 9000000 )       2   0.010%  99.980% 
[ 9000000, 10000000 )       1   0.005%  99.985% 
[ 10000000, 12000000 )       3   0.015% 100.000%