benchmark/leveldb/results/new-micro/mris_ran_wt_sata.2.log
LevelDB:    version 1.5
Date:       Sun Dec  2 02:41:00 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
./table/mris.h:637: [mris] Failed to open /mnt/largespace/mris_ran_wt_db
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
----- /mnt/largespace/mris_ran_wt_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0
mris_ran_wt  :   10391.078 micros/op;    6.4 MB/s
Microseconds per op:
Count: 20000  Average: 10390.6665  StdDev: 250024.75
Min: 118.0000  Median: 698.2379  Max: 11738704.0000
------------------------------------------------------
[     100,     120 )       1   0.005%   0.005% 
[     120,     140 )    8425  42.125%  42.130% ########
[     140,     160 )     950   4.750%  46.880% #
[     160,     180 )     103   0.515%  47.395% 
[     180,     200 )     228   1.140%  48.535% 
[     200,     250 )      63   0.315%  48.850% 
[     250,     300 )       2   0.010%  48.860% 
[     300,     350 )       2   0.010%  48.870% 
[     350,     400 )       3   0.015%  48.885% 
[     600,     700 )     227   1.135%  50.020% 
[     700,     800 )     700   3.500%  53.520% #
[     800,     900 )    2514  12.570%  66.090% ###
[     900,    1000 )     233   1.165%  67.255% 
[    1000,    1200 )     627   3.135%  70.390% #
[    1200,    1400 )     516   2.580%  72.970% #
[    1400,    1600 )     154   0.770%  73.740% 
[    1600,    1800 )     151   0.755%  74.495% 
[    1800,    2000 )    1855   9.275%  83.770% ##
[    2000,    2500 )    1107   5.535%  89.305% #
[    2500,    3000 )      97   0.485%  89.790% 
[    3000,    3500 )      38   0.190%  89.980% 
[    3500,    4000 )      31   0.155%  90.135% 
[    4000,    4500 )     254   1.270%  91.405% 
[    4500,    5000 )     844   4.220%  95.625% #
[    5000,    6000 )     508   2.540%  98.165% #
[    6000,    7000 )      33   0.165%  98.330% 
[    7000,    8000 )      11   0.055%  98.385% 
[    8000,    9000 )       1   0.005%  98.390% 
[   45000,   50000 )       2   0.010%  98.400% 
[   50000,   60000 )     150   0.750%  99.150% 
[   60000,   70000 )     123   0.615%  99.765% 
[   70000,   80000 )       4   0.020%  99.785% 
[   80000,   90000 )       3   0.015%  99.800% 
[   90000,  100000 )       7   0.035%  99.835% 
[  100000,  120000 )       2   0.010%  99.845% 
[  120000,  140000 )       1   0.005%  99.850% 
[  160000,  180000 )       1   0.005%  99.855% 
[  200000,  250000 )       3   0.015%  99.870% 
[  900000, 1000000 )       1   0.005%  99.875% 
[ 2000000, 2500000 )       1   0.005%  99.880% 
[ 3000000, 3500000 )       1   0.005%  99.885% 
[ 4000000, 4500000 )       1   0.005%  99.890% 
[ 4500000, 5000000 )       2   0.010%  99.900% 
[ 5000000, 6000000 )       6   0.030%  99.930% 
[ 6000000, 7000000 )       3   0.015%  99.945% 
[ 7000000, 8000000 )       6   0.030%  99.975% 
[ 8000000, 9000000 )       1   0.005%  99.980% 
[ 9000000, 10000000 )       1   0.005%  99.985% 
[ 10000000, 12000000 )       3   0.015% 100.000%