benchmark/leveldb/results/new-micro/mris_ran_wt_ssd.2.log
LevelDB:    version 1.5
Date:       Sun Dec  2 02:30:04 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
./table/mris.h:637: [mris] Failed to open /mnt/largespace/mris_ran_wt_db
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
----- /mnt/largespace/mris_ran_wt_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0
mris_ran_wt  :    7585.511 micros/op;    8.8 MB/s
Microseconds per op:
Count: 20000  Average: 7585.0920  StdDev: 173752.35
Min: 115.0000  Median: 701.6783  Max: 7173436.0000
------------------------------------------------------
[     100,     120 )      55   0.275%   0.275% 
[     120,     140 )    8470  42.350%  42.625% ########
[     140,     160 )     836   4.180%  46.805% #
[     160,     180 )     127   0.635%  47.440% 
[     180,     200 )     210   1.050%  48.490% 
[     200,     250 )      66   0.330%  48.820% 
[     250,     300 )       2   0.010%  48.830% 
[     350,     400 )       4   0.020%  48.850% 
[     450,     500 )       2   0.010%  48.860% 
[     600,     700 )     216   1.080%  49.940% 
[     700,     800 )     715   3.575%  53.515% #
[     800,     900 )    2633  13.165%  66.680% ###
[     900,    1000 )     160   0.800%  67.480% 
[    1000,    1200 )     554   2.770%  70.250% #
[    1200,    1400 )     547   2.735%  72.985% #
[    1400,    1600 )     141   0.705%  73.690% 
[    1600,    1800 )     205   1.025%  74.715% 
[    1800,    2000 )    2061  10.305%  85.020% ##
[    2000,    2500 )     925   4.625%  89.645% #
[    2500,    3000 )      77   0.385%  90.030% 
[    3000,    3500 )      29   0.145%  90.175% 
[    3500,    4000 )      52   0.260%  90.435% 
[    4000,    4500 )     253   1.265%  91.700% 
[    4500,    5000 )     894   4.470%  96.170% #
[    5000,    6000 )     396   1.980%  98.150% 
[    6000,    7000 )      27   0.135%  98.285% 
[    7000,    8000 )      18   0.090%  98.375% 
[    8000,    9000 )       3   0.015%  98.390% 
[   30000,   35000 )       1   0.005%  98.395% 
[   35000,   40000 )      68   0.340%  98.735% 
[   40000,   45000 )     204   1.020%  99.755% 
[   45000,   50000 )      17   0.085%  99.840% 
[   50000,   60000 )       5   0.025%  99.865% 
[  200000,  250000 )       1   0.005%  99.870% 
[  600000,  700000 )       1   0.005%  99.875% 
[ 1600000, 1800000 )       1   0.005%  99.880% 
[ 2000000, 2500000 )       1   0.005%  99.885% 
[ 3000000, 3500000 )       3   0.015%  99.900% 
[ 3500000, 4000000 )       3   0.015%  99.915% 
[ 4000000, 4500000 )       4   0.020%  99.935% 
[ 4500000, 5000000 )       1   0.005%  99.940% 
[ 5000000, 6000000 )       8   0.040%  99.980% 
[ 6000000, 7000000 )       2   0.010%  99.990% 
[ 7000000, 8000000 )       2   0.010% 100.000%