benchmark/leveldb/results/new-micro/mris_seq_wt_sata.1.log
LevelDB:    version 1.5
Date:       Sun Dec  2 02:35:12 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
./table/mris.h:637: [mris] Failed to open /mnt/largespace/mris_seq_wt_db
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
----- /mnt/largespace/mris_seq_wt_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0
mris_seq_wt  :    2153.915 micros/op;   30.8 MB/s
Microseconds per op:
Count: 20000  Average: 2153.6552  StdDev: 9160.56
Min: 119.0000  Median: 673.7079  Max: 222172.0000
------------------------------------------------------
[     100,     120 )       1   0.005%   0.005% 
[     120,     140 )    8334  41.670%  41.675% ########
[     140,     160 )     929   4.645%  46.320% #
[     160,     180 )     156   0.780%  47.100% 
[     180,     200 )     192   0.960%  48.060% 
[     200,     250 )      52   0.260%  48.320% 
[     250,     300 )       7   0.035%  48.355% 
[     350,     400 )       1   0.005%  48.360% 
[     600,     700 )     445   2.225%  50.585% 
[     700,     800 )    1114   5.570%  56.155% #
[     800,     900 )    3987  19.935%  76.090% ####
[     900,    1000 )     215   1.075%  77.165% 
[    1000,    1200 )     801   4.005%  81.170% #
[    1200,    1400 )     702   3.510%  84.680% #
[    1400,    1600 )     165   0.825%  85.505% 
[    1600,    1800 )      26   0.130%  85.635% 
[    1800,    2000 )      17   0.085%  85.720% 
[    2000,    2500 )      68   0.340%  86.060% 
[    2500,    3000 )      37   0.185%  86.245% 
[    3000,    3500 )      45   0.225%  86.470% 
[    3500,    4000 )      54   0.270%  86.740% 
[    4000,    4500 )     350   1.750%  88.490% 
[    4500,    5000 )    1161   5.805%  94.295% #
[    5000,    6000 )     614   3.070%  97.365% #
[    6000,    7000 )     126   0.630%  97.995% 
[    7000,    8000 )      56   0.280%  98.275% 
[    8000,    9000 )      19   0.095%  98.370% 
[    9000,   10000 )       4   0.020%  98.390% 
[   50000,   60000 )      42   0.210%  98.600% 
[   60000,   70000 )     181   0.905%  99.505% 
[   70000,   80000 )      74   0.370%  99.875% 
[   80000,   90000 )       8   0.040%  99.915% 
[   90000,  100000 )       3   0.015%  99.930% 
[  100000,  120000 )       7   0.035%  99.965% 
[  120000,  140000 )       1   0.005%  99.970% 
[  140000,  160000 )       2   0.010%  99.980% 
[  160000,  180000 )       1   0.005%  99.985% 
[  200000,  250000 )       3   0.015% 100.000%