benchmark/leveldb/results/new-micro/mris_seq_wt_ssd.2.log
LevelDB:    version 1.5
Date:       Sun Dec  2 02:26:11 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
./table/mris.h:637: [mris] Failed to open /mnt/largespace/mris_seq_wt_db
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
----- /mnt/largespace/mris_seq_wt_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0
mris_seq_wt  :    1694.528 micros/op;   39.2 MB/s
Microseconds per op:
Count: 20000  Average: 1694.1885  StdDev: 5527.78
Min: 114.0000  Median: 677.5109  Max: 224756.0000
------------------------------------------------------
[     100,     120 )     131   0.655%   0.655% 
[     120,     140 )    8351  41.755%  42.410% ########
[     140,     160 )     734   3.670%  46.080% #
[     160,     180 )     168   0.840%  46.920% 
[     180,     200 )     201   1.005%  47.925% 
[     200,     250 )      54   0.270%  48.195% 
[     250,     300 )       1   0.005%  48.200% 
[     300,     350 )       1   0.005%  48.205% 
[     350,     400 )       4   0.020%  48.225% 
[     600,     700 )     458   2.290%  50.515% 
[     700,     800 )    1121   5.605%  56.120% #
[     800,     900 )    4049  20.245%  76.365% ####
[     900,    1000 )     192   0.960%  77.325% 
[    1000,    1200 )     835   4.175%  81.500% #
[    1200,    1400 )     643   3.215%  84.715% #
[    1400,    1600 )     197   0.985%  85.700% 
[    1600,    1800 )      26   0.130%  85.830% 
[    1800,    2000 )       7   0.035%  85.865% 
[    2000,    2500 )      73   0.365%  86.230% 
[    2500,    3000 )      24   0.120%  86.350% 
[    3000,    3500 )      35   0.175%  86.525% 
[    3500,    4000 )      35   0.175%  86.700% 
[    4000,    4500 )     364   1.820%  88.520% 
[    4500,    5000 )    1164   5.820%  94.340% #
[    5000,    6000 )     635   3.175%  97.515% #
[    6000,    7000 )      98   0.490%  98.005% 
[    7000,    8000 )      56   0.280%  98.285% 
[    8000,    9000 )      12   0.060%  98.345% 
[    9000,   10000 )       8   0.040%  98.385% 
[   14000,   16000 )       1   0.005%  98.390% 
[   35000,   40000 )      87   0.435%  98.825% 
[   40000,   45000 )     215   1.075%  99.900% 
[   45000,   50000 )      13   0.065%  99.965% 
[   50000,   60000 )       6   0.030%  99.995% 
[  200000,  250000 )       1   0.005% 100.000%